

# Combinación de conjuntos de datos

Pandas proporciona funciones para [combinar diferentes conjuntos de datos](http://pandas.pydata.org/pandas-docs/stable/merging.html) basadas en el [álgebral relacional](https://en.wikipedia.org/wiki/Relational_algebra).


Para ello usamos 4 métodos, **concat**, **append**,  **merge** y  **join**

In [1]:
import pandas as pd
import numpy as np

In [10]:
# Creamos unos dataframes de ejemplo 

df1 = pd.DataFrame(np.random.randn(5, 2),
                   columns=['A', 'B'],
                   index=np.arange(5))
df2 = pd.DataFrame(np.random.randn(3, 3),
                   columns=['A', 'B', 'C'],
                   index=np.arange(3, 6))

In [11]:
df1

          A         B
0  1.479153  0.839608
1 -0.328131 -0.359049
2  0.090491  0.706404
3 -0.687942  0.183080
4  0.429724  0.873399

In [12]:
df2

          A         B         C
3 -0.408211 -0.399440  0.460380
4 -1.248844 -0.688253 -0.082691
5  0.468453  0.904651 -0.447402

La función **concat** permite 'unir' estructuras de datos pandas usando filas o columnas.

In [13]:
# Unimos los datos a lo largo del eje de las filas

new = pd.concat([df1, df2], axis=0, join='inner')
new

          A         B
0  1.479153  0.839608
1 -0.328131 -0.359049
2  0.090491  0.706404
3 -0.687942  0.183080
4  0.429724  0.873399
3 -0.408211 -0.399440
4 -1.248844 -0.688253
5  0.468453  0.904651

In [6]:
# Unimos los datos a lo largo del eje de las columnas

new = pd.concat([df1, df2], axis=1, join='inner')
new

          A         B         A         B         C
3 -1.477255  0.943398 -0.243018  0.072296 -1.686516
4 -0.676981  0.415728 -0.217716 -0.489256 -0.550598

En los dos ejemplos anteriores hemos realizado la unión mediante un inner join, es decir solo obtenemos la intersección de los dos DFs. Si queremos obtener la unión recurrimos al parámetro outer.

In [7]:
# Realizamos la unión de los dos dfs, a lo lardo de las columnas, devolviendo tanto los valores que 
# intersectan como los que no, es decir su unión.

new = pd.concat([df1, df2], axis=1, join='outer')
new

          A         B         A         B         C
0  0.825254 -0.743498       NaN       NaN       NaN
1 -0.323500 -0.584359       NaN       NaN       NaN
2  0.743907 -1.165409       NaN       NaN       NaN
3  1.223081 -0.284531 -0.846760  0.096472 -0.094835
4 -1.735772  0.597433 -1.086400  0.646303  0.671372
5       NaN       NaN  0.267365  2.240195 -2.033595

Mediante el método **append** podemos agregar los registros de una DF a otro.

In [8]:
df1.append(df2)

          A         B         C
0  0.825254 -0.743498       NaN
1 -0.323500 -0.584359       NaN
2  0.743907 -1.165409       NaN
3  1.223081 -0.284531       NaN
4 -1.735772  0.597433       NaN
3 -0.846760  0.096472 -0.094835
4 -1.086400  0.646303  0.671372
5  0.267365  2.240195 -2.033595

Para unir dos `DataFrame`s usando **valores de columnas** podemos también utilizar la función **merge**. Este método permite realizar las uniones de forma similar a un join en SQL, mediante las opciones del parámetro 'how': {left', 'right', 'outer', 'inner'}.




<center><img src="img/joins.png"></center>


Vemos unos ejemplos de cada tipo.

In [19]:
df1 = pd.DataFrame(np.array([np.arange(1, 6),
                             np.random.choice([1, 2, 3], size=5),
                             np.arange(1, 6) * 10]).T,
                   columns=['A', 'col', 'B'])

df2 = pd.DataFrame(np.array([np.arange(11, 16),
                             np.random.choice([1, 2, 3], size=5),
                             np.arange(1, 6) * 100]).T,
                   columns=['A', 'col', 'B'])

In [20]:
df1

   A  col   B
0  1    3  10
1  2    1  20
2  3    1  30
3  4    3  40
4  5    1  50

In [21]:
df2

    A  col    B
0  11    2  100
1  12    3  200
2  13    2  300
3  14    2  400
4  15    2  500

In [22]:
# Obtenemos la intersección

pd.merge(df1, df2, on=['col'], how='inner')

   A_x  col  B_x  A_y  B_y
0    1    3   10   12  200
1    4    3   40   12  200

In [23]:
# Obtenemos la unión

pd.merge(df1, df2, on=['col'], how='outer')

   A_x  col   B_x   A_y    B_y
0  1.0    3  10.0  12.0  200.0
1  4.0    3  40.0  12.0  200.0
2  2.0    1  20.0   NaN    NaN
3  3.0    1  30.0   NaN    NaN
4  5.0    1  50.0   NaN    NaN
5  NaN    2   NaN  11.0  100.0
6  NaN    2   NaN  13.0  300.0
7  NaN    2   NaN  14.0  400.0
8  NaN    2   NaN  15.0  500.0

In [24]:
# Obtenemos el left join

pd.merge(df1, df2, on=['col'], how='left')

   A_x  col  B_x   A_y    B_y
0    1    3   10  12.0  200.0
1    2    1   20   NaN    NaN
2    3    1   30   NaN    NaN
3    4    3   40  12.0  200.0
4    5    1   50   NaN    NaN

In [25]:
# Obtenemos el right join

pd.merge(df1, df2, on=['col'], how='right')

   A_x  col   B_x  A_y  B_y
0  1.0    3  10.0   12  200
1  4.0    3  40.0   12  200
2  NaN    2   NaN   11  100
3  NaN    2   NaN   13  300
4  NaN    2   NaN   14  400
5  NaN    2   NaN   15  500

En estos ejemplos teníamos la misma columna (columna 'col') en ambos DF, pero esto no siempre es así. Para realizar estas uniones recurrimos a los parámetros `left_on/right_on`.

In [16]:
# Tenemos ahora dos columnas col_1 y col_2 en lugar de col


df1 = pd.DataFrame(np.array([np.arange(1, 6),
                             np.random.choice([1, 2, 3], size=5),
                             np.arange(1, 6) * 10]).T,
                   columns=['A', 'col_1', 'B'])

df2 = pd.DataFrame(np.array([np.arange(11, 16),
                             np.random.choice([1, 2, 3], size=5),
                             np.arange(1, 6) * 100]).T,
                   columns=['A', 'col_2', 'B'])

In [17]:
df1

   A  col_1   B
0  1      3  10
1  2      2  20
2  3      3  30
3  4      3  40
4  5      2  50

In [18]:
df2

    A  col_2    B
0  11      1  100
1  12      2  200
2  13      3  300
3  14      3  400
4  15      2  500

In [19]:
df1.merge(df2, left_on='col_1', right_on='col_2', how='inner')

   A_x  col_1  B_x  A_y  col_2  B_y
0    1      3   10   13      3  300
1    1      3   10   14      3  400
2    3      3   30   13      3  300
3    3      3   30   14      3  400
4    4      3   40   13      3  300
5    4      3   40   14      3  400
6    2      2   20   12      2  200
7    2      2   20   15      2  500
8    5      2   50   12      2  200
9    5      2   50   15      2  500

## Combinando usando el método `join`

El método **join** permite unir las columnas de 2 dataframes, de forma similar al método merge, pero con menos parámetros. Al igual que el método merge permite usar el parámetro `how` para controlar la forma del join ({'left', 'right', 'outer', 'inner'})

In [26]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                    index=['K0', 'K1', 'K2'])

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

In [27]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [28]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [29]:
result = left.join(right, how='outer')
result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

Obtenemos el mismo resultado usando un merge

In [32]:
result = pd.merge(left, right, left_index=True, right_index=True, how='outer')
result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Ejercicios

## Ejercicio 1

- a. Cree 3 Series diferentes de longitud 100 de este modo:

    1. La primera debe estar compuesta por números aleatorios de 1 a 4.
    2. La segunda debe estar compuesta por números aleatorios de 1 a 3.
    3. La tercera debe estar compuesta por números aleatorios de 10000 a 30000

- b. Cree un DF uniendo por columnas las 3 Series anteriores.
- c. Cambie los nombres de las columnas a bedrs, bathrs, price_sqr_meter

Cree 3 Series diferentes...

In [25]:
# Aqui su respuesta

Cree un DF uniendo por columnas las 3 Series anteriores

In [26]:
# Aqui su respuesta

Cambie los nombres de las columnas a bedrs, bathrs, price_sqr_meter

In [27]:
# Aqui su respuesta

## Ejercicio 2

Dados los siguientes datos:

raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

- a. Cree un DF por cada set de datos.
- b. Una los 2 primeros DF de modo que genere una lista con todos los usuarios.
- c. Una el DF del apartado anterior con los datos de las notas (raw_data_3) de modo que a cada usuario se le asigne su nota.
- d. Una los datos de raw_data_1 y raw_data_2 únicamente de los registros con igual subject_id

Cree un DF por cada set de datos.

In [28]:
# Aqui su respuesta

In [29]:
# Aqui su respuesta

Una los 2 primeros DF de modo que genere una lista con todos los usuarios.

In [30]:
# Aqui su respuesta

Una el DF del apartado anterior con los datos de las notas (raw_data_3) de modo que a cada usuario se le asigne su nota.

In [31]:
# Aqui su respuesta

Una los datos de raw_data_1 y raw_data_2 únicamente de los registros con igual subject_id

In [32]:
# Aqui su respuesta